jmeter_test_plans/parse_test_plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="parse enpoint test">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="parse thread group">
        <stringProp name="ThreadGroup.num_threads">${__P(thread_concurrency)}</stringProp>
        <intProp name="ThreadGroup.ramp_time">10</intProp>
        <longProp name="ThreadGroup.duration">30</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">stoptest</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="parse request">
          <stringProp name="HTTPSampler.domain">${__P(test_server_ip)}</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.path">/api/parse?searchString=357d1284-b802-4cc4-8eb5-e6c63f69ee63</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">[&quot;cf50db42-5c1c-45d8-a59a-8926fb3d8f34&quot;,&quot;457beefc-c9b2-4d3a-8994-034a484173ab&quot;,&quot;b3ff8986-c34b-4296-9389-fbaecadb6780&quot;,&quot;2c405490-b8af-485d-a154-788b46b4d406&quot;,&quot;d5afa7a9-662d-4a54-8486-7c027b27cadd&quot;,&quot;a4c08942-7e59-4400-bdc6-adf35e2afc07&quot;,&quot;49c92d33-38b8-4d4e-b451-d21030885bd1&quot;,&quot;d652b3bd-4f0e-4e2e-ae2c-84e73404fb08&quot;,&quot;b5bf9cfc-97f6-4185-911a-51fc98ffd637&quot;,&quot;82fa1826-7dfa-4e44-9e1d-c8f7ad2920cc&quot;,&quot;db8c0e0b-d2b2-4adb-a1cc-4a13c1dbbc12&quot;,&quot;12a00ac8-4e1c-4e1b-8f4f-0afc19d8dcb8&quot;,&quot;e19d9e8a-b46a-4792-8b17-6318995278d5&quot;,&quot;af1fbd6b-3c5e-40ca-9b3b-0dc452f3d3c8&quot;,&quot;285c4224-98a5-4bd7-a1f1-301394830229&quot;,&quot;a2c5ad84-c15f-4cd6-893a-43061626621c&quot;,&quot;df0e520e-bff9-4216-9a72-ef046a5d0949&quot;,&quot;3bdcdf30-a95d-46ba-b790-8c51f148ad3a&quot;,&quot;b058f171-be78-4633-a229-d733761e76a9&quot;,&quot;ef852b2a-98b0-4afe-aadc-9185494aa102&quot;,&quot;32422084-63cf-41c7-ba00-17cd3253e077&quot;,&quot;3355051f-962a-4325-a592-7fba6052cd26&quot;,&quot;a6168147-f422-4e96-a7b1-51a85c767ec9&quot;,&quot;85448cbb-926a-41df-b3a1-3b2b91e8865a&quot;,&quot;db17bb36-41fe-4241-ac9c-9f5293fa9e9a&quot;,&quot;8960c20f-c487-4f9b-92ee-1e506ce13b67&quot;,&quot;9ef668be-d4f9-48c0-a9c3-ad2b6ff97e83&quot;,&quot;ea546ef8-6769-4cdb-b252-1666d29a1619&quot;,&quot;6b570b34-a7a3-45d9-968c-94bea14fd80a&quot;,&quot;c4ffd251-ccdb-4688-99a8-8501ccdb83bc&quot;,&quot;2e9fff1d-d783-481b-8808-74774b3bec0e&quot;,&quot;1b23092b-3d7e-45d7-929d-e446ee56db5d&quot;,&quot;a15e2f4c-657a-427a-97b4-4f77e3d7d7c6&quot;,&quot;be25da24-3ae9-4345-9f61-4e41594a6ce0&quot;,&quot;ce135a48-0ad3-4e5a-b09d-042fc98ace20&quot;,&quot;cd5d06c9-167c-4c92-906e-2666a07f6464&quot;,&quot;549a006c-70e4-4ca1-9ae1-43abae918629&quot;,&quot;0a2347c3-dae5-4a99-8efc-fd9d3b73288a&quot;,&quot;5089eb6e-c346-44d3-9857-1d1b6031163d&quot;,&quot;457665e9-15dd-4742-ad3b-d469d4feb245&quot;,&quot;cb1bb828-6e19-4ac3-98f6-13b37665c083&quot;,&quot;16e04cec-69b8-4f51-a50e-df54c9e17278&quot;,&quot;61349e84-0dc8-4538-9e65-145211a014e8&quot;,&quot;1c63a736-51e0-4c3d-b299-ab0445135cf4&quot;,&quot;5fec00eb-c297-4720-aca3-a915d740fb32&quot;,&quot;4d7a8634-51f3-4247-88c1-58dc1d6f5c6e&quot;,&quot;d59c24e6-6bea-414b-8d74-a5cbcc62cfc1&quot;,&quot;2458460b-cc3a-49a1-80ae-10de64e10c5a&quot;,&quot;644247de-27e3-46ce-98a8-b63ae209d163&quot;,&quot;8fd3df98-087c-488e-9cb8-8519e3f817b9&quot;,&quot;906676c6-0dc8-4d25-8054-1a20ef89961f&quot;,&quot;69c8eacd-901d-400d-b106-3edbe94d3977&quot;,&quot;8b5d03e9-64cf-419d-a0bf-c27d9550a252&quot;,&quot;fe2ad09b-341e-436b-9c79-8cb21afdd7e5&quot;,&quot;5b60eddf-d59a-47db-888b-0c5859d47925&quot;,&quot;ebfad0fc-7f5b-4252-b189-5d2400b54d48&quot;,&quot;5a96d8ab-68e0-495d-892d-b3629878eef8&quot;,&quot;ad1d9790-817e-40d8-8a68-081bfea2fa69&quot;,&quot;e29d7180-4f96-4810-9616-3a99a2bff32e&quot;,&quot;8b606e88-5f74-4eff-8bdb-f39ae7ad4c08&quot;,&quot;d5b03e5e-1902-429c-9bb8-eba729c8e973&quot;,&quot;37f12b9c-3de4-4f2c-b197-b3f8e4400c4f&quot;,&quot;4a9fdd6f-218b-4b39-9650-f3e4b2120ea5&quot;,&quot;dfb63331-4edd-41ab-9f6b-1e1fe39e3099&quot;,&quot;a864b310-d1a8-4e85-8b3f-a30bf086c437&quot;,&quot;2c1bad6b-67e0-4a96-8ded-e4a8cdea7f91&quot;,&quot;ace9b587-578f-46a8-877b-e95ceb4ffbe3&quot;,&quot;55c15f5d-2481-4060-8e80-304117c26179&quot;,&quot;6a00d251-4c17-41b0-8cd2-05d7cdcc18ac&quot;,&quot;50abe6bb-271d-4d71-a3f9-0842b35f1d85&quot;,&quot;deeb1ecd-609a-4c12-a892-29f760b73872&quot;,&quot;bdc38cad-fe86-426d-8549-8f25c0ddcc14&quot;,&quot;ed27c44f-2852-4309-a59b-ee6e59c01166&quot;,&quot;1d8afcf2-85ea-4337-9af9-aa16724f3aed&quot;,&quot;29a9927b-4b9a-4e50-9c88-b06adcfea36b&quot;,&quot;9366725e-7c7e-4df1-9982-c14fceb97df5&quot;,&quot;57dadb94-ea0a-4dea-9a81-96c4d3b3259c&quot;,&quot;c9f0fa40-a055-405c-b534-448b499eacf4&quot;,&quot;a96253be-00b0-49bc-8d59-966482c948b2&quot;,&quot;6c446c24-1dc9-4320-9c07-36b32ccda0f6&quot;,&quot;aa796076-aa0f-47f6-8b66-94c27adf4f51&quot;,&quot;136da309-60d9-46aa-b43a-fcfe98c4c6cd&quot;,&quot;b5603642-af89-4f7b-8b39-1de530aed2d7&quot;,&quot;77e61b0e-40c7-40d7-8e49-d2478bf2b627&quot;,&quot;66b9aa73-3708-49a7-9610-0094a979f610&quot;,&quot;2046bc61-32b5-49db-9ef0-0aa91526a3f1&quot;,&quot;6651c606-a489-4979-8d33-f58c098d36db&quot;,&quot;31490c4a-8162-4cd9-8ecc-ad440bd16680&quot;,&quot;9e446a82-ce06-46df-9a4e-c48dbff55ebf&quot;,&quot;6e3a11b8-6e53-4c3b-a0f5-1e2d34d62560&quot;,&quot;530e5f5a-1fdf-416a-a1f0-ec8af347a53a&quot;,&quot;2fce765f-a78a-4f3d-8ebb-af16c0a9486c&quot;,&quot;90e8c8b3-f726-4f01-abab-287fdd905c67&quot;,&quot;4825c71e-fa67-4e4e-a948-a29e6f0eda26&quot;,&quot;99913570-6088-42ef-beec-85617c5e4818&quot;,&quot;33b87b72-3e1e-4b5e-95f6-a463bfa2772a&quot;,&quot;abe8550d-10a7-4b61-b4ca-e1636cbde046&quot;,&quot;c67e1a68-5bfb-49d2-a375-f4d455ce3165&quot;,&quot;37ea2b0a-475d-4383-9f77-55b2b5edc9be&quot;,&quot;357d1284-b802-4cc4-8eb5-e6c63f69ee63&quot;]</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>